Import New Account to SAP

<?xml version="1.0" encoding="UTF-8"?>
<soap-env:Envelope xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/">
  <soap-env:Header/>
  <soap-env:Body>
    <n0:CustomerBundleMaintainRequest_sync_V1 xmlns:n0="http://sap.com/xi/SAPGlobal20/Global">
      <Customer actionCode="{{ACTION_CODE}}"> <!-- 01 = Create, 02 = Update -->
        <CategoryCode>{{CATEGORY_CODE}}</CategoryCode>
        <CustomerIndicator>{{IS_CUSTOMER}}</CustomerIndicator>
        <LifeCycleStatusCode>{{STATUS_CODE}}</LifeCycleStatusCode> <!-- 2 = Active -->

        <Person>
          <GivenName>{{FIRST_NAME}}</GivenName>
          <FamilyName>{{LAST_NAME}}</FamilyName>
        </Person>

        <!-- Optional: Add contact information -->
        <!--
        <ContactInformation>
          <Email>{{EMAIL}}</Email>
          <Phone>{{PHONE}}</Phone>
        </ContactInformation>
        -->
        
      </Customer>
    </n0:CustomerBundleMaintainRequest_sync_V1>
  </soap-env:Body>
</soap-env:Envelope>
